Firma/nalog_encrypted_and_signed.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns2:getNalogZaPlacanjeRequest xmlns:ns2="http://nalogZaPlacanje.com"><xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Content"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:KeyName>Sifrovan tajni kljuc</ds:KeyName>
<xenc:EncryptedKey><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/><xenc:CipherData><xenc:CipherValue>fWOqr7yP5Y0mln86EFYrkq0tGVnCcZTCAy9JnlcDrCyAEn3lg7UVcR+TMXI1nURgJ6TSAmBd71I1&#13;
lu19Ogw7w4huk7LzEiVuF8xlEnm0KrrPblPR/7+RhvbHzrZBA9Ior9nlTwIw1J3nK8/jKFBHY1+O&#13;
qz0E0GWvwZ2lKBfsHunQrcyjWcFOU92dX8C2gkE7263wBfm3IJ3hLOmiYvcwVkUru/ckbY4uLl17&#13;
JUkJgAknulguuhvEoEe+kmlM5MRFPVkQybptKcF9/bMoa4MJsoMwyt3Z8E6OVKg7U+GEmsIpE/m1&#13;
bqnTJ3EHawoR8xK6bGGon4gU99wbkkyYNIrYOA==</xenc:CipherValue></xenc:CipherData></xenc:EncryptedKey></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>uP8wZoJOdQMjmAtdKRoj3DEC7K310HstBO0n0rGsYiv33TVpWvj2IFCreLtGRz4XiWlWSMlbOHna&#13;
ZdaVkssLvCY9JV/qGyPnCWalGhyxTcKQntZPeJ1WGBX6HptKCbbMSp2diyS9pf4mDar065Rwt+Pd&#13;
w3FP+2HMGmuUwCz/+2Ng5cn6UIdxPKBl4016cmxzX1U/KdDp5Smto8cE6hC9jR8VKI3vwkjk6AG0&#13;
8Hz/lv6bWbNNJdZR7vCQBgDurS/FPy4zGK39eCjtjUOq9lD2rsM9PEgjeqNL/fZY7f6J8Cvu4fjR&#13;
VtudFSYQLd6L/JBKys4an2MREzK78fof6DgJQie37U1RyCVEgYaMjawN0exIfFLNuQ8ViWj/j/21&#13;
Z2TGXRK9MAphjmOTqbZ2ltNAu7PseeIyWNb2PWgPfzyFxiPLzH36FxjKPj/Yr5VMJ8p1BP0L1j7Y&#13;
9gXriWFAq8tajtFD5C8pbGsUPhttBc8Bzk6plT83ZAn2A6dlLj5WyG5r4wYnyCvd9WzVQWh5tO1z&#13;
9cR4DAb3bdCZuj+ZSN1ULI/YVF0ohMe0vgxqOMx0VR1LqmBXDWXI6o5hNVwytyN/28FDasTeaWJf&#13;
q6wsyqq8mKkQs9MbJCufpML1FphFcbBQeSgT0NeiORw8KrUR25c8M2ysbRVz1jeGEeJi7iscszzz&#13;
AQii2iruxeSz3YZghquIuBp7fVZNbxYpuqcBTcAeCWmJol/DNQM6pBfss3N/KKlGNMkPe9BcuQES&#13;
NR+oq5sRPA54f0S0DtAXKCK4YoReb5MFetitz9AAORzGhNnvz/8majaTc8CYVT2P+QQPQJn8B+pw&#13;
hXWTgvZlHd9vkw9cBtLAJGG42NMyoe611aFDsgrWnQ2BQ5Q19ih5/A0jyH2OUe9Gr20PnY5tstMQ&#13;
LRl4zBWJbXLPAEfvscciDWN6Sk7p+eSziEiJoQ==</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></ns2:getNalogZaPlacanjeRequest></SOAP-ENV:Body><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<ds:Reference URI="">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
<ds:Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315#WithComments"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>6ahryTD2xEzHOTh4t6d9gjWMXLM=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>
Eoqifjf0w9iv7goZ3gon366pViZRD8y4iTpsDb++D1K/QPLgt3EzWA8vzw3LyEZuJAM9Pf2eJr7C&#13;
O9KXcTgMGvDLMmaMU5FAsp9PFuh5Nn3RdRcF3M4PEZoLRGd4vUIh/WLVqXT0ZbRdi5EdL/1l7imt&#13;
q5d3PnPs2hMaQk7Yz6xAEyH1hY+SjybqavlaX/jx2nD4Wi3rJXQsoQX7zwID7TnPXT9+yHUKqlTk&#13;
eqJiBKFYrQMFBeYft9QOZKhW4iK6s16ObQ51lVyHVGpl+Fzy8dIncgI3VGooCvTRL48pfHL5nhCy&#13;
qf2YDvhjT1XpC71Kla47zSzPWJCzfYHS+kNkPA==
</ds:SignatureValue>
<ds:KeyInfo>
<ds:KeyValue>
<ds:RSAKeyValue>
<ds:Modulus>
qvq9L4TdlpRND/aAnYa969IckeVyjGtDV1DHs/GvtFYRHuW6giXxjm3SUtVtTQoRTIoqBSLfpMBe&#13;
JODaAh6rACQpAgWymU4pbRXz7UIPhhpkyNeEXwtl63ILNOtIj6bMGtKnj6cmMYzNvUoQBixbFTSg&#13;
ixi3O996Z/YvRQLgW1obxiooCBoZuFEnFlfcUzCtHE5XmvZUWs4EjNA/oj9H2rJ34SMBz89XNyTl&#13;
0TBQh4ZPYw0WxzDJAyrtAGLWaPq1vOyA8PnXX33kQHGB7ZJVTVDlsFoD3ftWYQ63/LPshqM3P8BE&#13;
/uav8luUhVcVRDCDfvvpvmmJSVi7fK0zY4QQ7Q==
</ds:Modulus>
<ds:Exponent>AQAB</ds:Exponent>
</ds:RSAKeyValue>
</ds:KeyValue>
<ds:X509Data>
<ds:X509Certificate>
MIIDgjCCAmqgAwIBAgIEWUhRPjANBgkqhkiG9w0BAQsFADB6MRAwDgYDVQQDDAdCYW5rYSBBMRAw&#13;
DgYDVQQKDAdCYW5rYSBBMQ4wDAYDVQQLDAVCYW5rYTEMMAoGA1UEBhMDc3JiMRowGAYJKoZIhvcN&#13;
AQkBFgtiYW5rYUBhLmNvbTEaMBgGCgmSJomT8ixkAQEMCjE0OTc5MTE0OTIwHhcNMTcwNjE5MDAw&#13;
MDAwWhcNMTgwNjE5MDAwMDAwWjB6MRAwDgYDVQQDDAdGaXJtYSBBMRAwDgYDVQQKDAdGaXJtYSBB&#13;
MQ4wDAYDVQQLDAVGaXJtYTEMMAoGA1UEBhMDc3JiMRowGAYJKoZIhvcNAQkBFgtmaXJtYUBhLmNv&#13;
bTEaMBgGCgmSJomT8ixkAQEMCjE0OTc5MTE2MTQwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEK&#13;
AoIBAQCq+r0vhN2WlE0P9oCdhr3r0hyR5XKMa0NXUMez8a+0VhEe5bqCJfGObdJS1W1NChFMiioF&#13;
It+kwF4k4NoCHqsAJCkCBbKZTiltFfPtQg+GGmTI14RfC2Xrcgs060iPpswa0qePpyYxjM29ShAG&#13;
LFsVNKCLGLc733pn9i9FAuBbWhvGKigIGhm4UScWV9xTMK0cTlea9lRazgSM0D+iP0fasnfhIwHP&#13;
z1c3JOXRMFCHhk9jDRbHMMkDKu0AYtZo+rW87IDw+ddffeRAcYHtklVNUOWwWgPd+1ZhDrf8s+yG&#13;
ozc/wET+5q/yW5SFVxVEMIN+++m+aYlJWLt8rTNjhBDtAgMBAAGjEDAOMAwGA1UdEwEB/wQCMAAw&#13;
DQYJKoZIhvcNAQELBQADggEBABPql7l2SOkUU7ON9SEqNswIVn+RyAL+Y/9OBJ+0aU0lcvpgbFNZ&#13;
5GsCMufSLRK0z1HU2rKW969FAnxAbfvMAvTh8a1VKuSF1P259bjFSoCekPfDW8irKtdBwlXUQtfn&#13;
Av2mVWLhk9XhBQtN78BktFLuXG7aRfbgb6L/e9M6Z1XFM8QK5WzBo1Y/7C7js7R0thIX9OsBs0gD&#13;
yoK644NxtAH2JljgqREpcjKZwNhfXZ++SIK8O5zUM7hlo1C7N1XqkURhc7J5ADRIHf5cOJCqiE6d&#13;
Q2WnEbguq2W6D5tTN/qjfkOtu1AWa29vz3O2piue9WkfIqxC84/llz20jrIWfow=
</ds:X509Certificate>
</ds:X509Data>
</ds:KeyInfo>
</ds:Signature></SOAP-ENV:Envelope>